{"pages":[],"posts":[{"title":"Build a personal blog website for free based on Hexo with Coding and GitHub","text":"This is a blog to build a personal blog website based on hexo with Coding and GitHub. This blog mainly references Docs | Hexo, Getting Started with Icarus.InstallationThere are several things you need to install before building.Node.jsNode.js provides an official installer for most platforms. For users in mainland China, you can go to Taobao Node.js Mirror to download. There are several Other installation methods: Windows: Install via nvs (recommended) or nvm. Mac: Use Homebrew or MacPorts to install. Linux (DEB/RPM-based) : Install from NodeSource. Others: Use the corresponding package manager to install, you can refer to the Guide provided by Node.js For Windows users: When using the official Node.js installer, make sure to check the Add to PATH option (checked by default). For Mac/Linux users: If there is an error of EACCES permission when trying to install Hexo, please follow Guidelines issued by npmjs Fix the problem. It is strongly recommended to not use root, sudo, etc. to overwrite permissions. If you installed Node.js using Snap, you may need to manually run npm install in the target folder when initializing a blog. Open command line, type node --version and npm --version, you will get the version number of Node.js and npm (npm is actually the package manager for Node.js, it was installed when installing Node.js), otherwise the installation failed.1234&gt;&gt; node --versionv14.15.1&gt;&gt; npm --version6.14.8Git For Windows: Click Git - Downloads to download Git and install it. For Mac: Using Homebrew or MacPorts, or download the installer. For Linux (Ubuntu, Debian): sudo apt-get install git-core For Linux (Fedora, Red Hat, CentOS)：sudo yum install git-core For Mac users: If you may encounter problems during compilation, please install Xcode in the App Store first. After Xcode is completed, launch and enter Preferences -&gt; Download -&gt; Command Line Tools -&gt; Install to install the command line tools. For Windows users: For users in China, you can go to Taobao Git for Windows Mirror to download the git installation package. Open command line, type git --version, you will get the version number of Git, otherwise the installation failed.12&gt;&gt; git --versiongit version 2.29.2.windows.1HexoAfter all the necessary applications are installed, you can use npm to install Hexo.1&gt;&gt; npm install -g hexo-cliConfigure blog websiteThe first blog websiteCreate your own local blog directory, like C:/Users/&lt;Your PC Name&gt;/Documents/blog, type hexo init to initialize the Hexo blog pages:123456789101112&gt;&gt; cd C:/Users/&lt;Your PC Name&gt;/Documents/blogC:/Users/&lt;Your PC Name&gt;/Documents/blog&gt; hexo initINFO Cloning hexo-starter https://github.com/hexojs/hexo-starter.gitINFO Install dependenciesadded 185 packages from 440 contributors and audited 191 packages in 18.702s14 packages are looking for funding run `npm fund` for detailsfound 0 vulnerabilitiesINFO Start blogging with Hexo!To test our blog website,use hexo g or hexo generate to generate static files and use hexo s or hexo server to run server:12345678910C:/Users/&lt;Your PC Name&gt;/Documents/blog&gt; hexo gINFO Validating configINFO Start processingINFO Files loaded in 96 ms---------INFO 28 files generated in 306 msC:/Users/&lt;Your PC Name&gt;/Documents/blog&gt; hexo sINFO Validating configINFO Start processingINFO Hexo is running at http://localhost:4000 . Press Ctrl+C to stop.Open http://localhost:4000/ or http://127.0.0.1:4000/, you can see your blog website for the first time, how exciting is this!Make your website beautiful: Icarus themeIcarus is a simple, delicate, and modern theme for the static site generator Hexo. To install Icarus, take one of the following approaches: Download the source code tarball from the GitHub and extract it to your Hexo site&apos;s theme directory (like C:/Users/&lt;Your PC Name&gt;/Documents/blog/themes/icarus). Alternatively, you can use Git to clone the Icarus repository to the themes directory: 12&gt;&gt; cd C:/Users/&lt;Your PC Name&gt;/Documents/blog&gt;&gt; git clone https://github.com/ppoffice/hexo-theme-icarus.git themes/icarus -b &lt;version number&gt; --depth 1 You can omit -b &lt;version number&gt; to get the latest development version of Icarus. Leave --depth 1 out if you want to download full Git commit history of Icarus as well. 12&gt;&gt; cd C:/Users/&lt;Your PC Name&gt;/Documents/blog&gt;&gt; git clone https://github.com/ppoffice/hexo-theme-icarus.git themes/icarus Furthermore, you can install Icarus as a Git submodule with the following command: 1&gt;&gt; git submodule add https://github.com/ppoffice/hexo-theme-icarus.git themes/icarus To install Icarus as a node package via NPM, run the following command from the root of your Hexo site: 1&gt;&gt; npm install -S hexo-theme-icarus Next, activate Icarus in your site’s _config.yml file:1theme: icarusor use the hexo command to change the theme to Icarus:1&gt;&gt; hexo config theme icarusNext, use hexo g to generate static files and use hexo s to run server:12&gt;&gt; hexo g&gt;&gt; hexo sYou may get the following error, at least for me:123456789ERROR Package bulma-stylus is not installed.ERROR Package hexo-renderer-inferno is not installed.ERROR Package hexo-component-inferno is not installed.ERROR Package inferno is not installed.ERROR Package inferno-create-element is not installed.ERROR Please install the missing dependencies your Hexo site root directory:ERROR npm install --save bulma-stylus@0.8.0 hexo-renderer-inferno@^0.1.3 hexo-component-inferno@^0.10.1 inferno@^7.3.3 inferno-create-element@^7.3.3ERROR or:ERROR yarn add bulma-stylus@0.8.0 hexo-renderer-inferno@^0.1.3 hexo-component-inferno@^0.10.1 inferno@^7.3.3 inferno-create-element@^7.3.3As the error messages says, there are several packages are not installed, this should be because the Icarus need these packages to generate static files. To solve this problem, use npm to install corresponding packages:123456&gt;&gt; npm install bulma-stylus&gt;&gt; npm install hexo-renderer-inferno&gt;&gt; npm install hexo-component-inferno&gt;&gt; npm install inferno&gt;&gt; npm install inferno-create-element&gt;&gt; npm install --save bulma-stylus@0.8.0Run hexo g and hexo s again, open http://localhost:4000/ or http://127.0.0.1:4000/, you will see your blog website is wearing Icarus&apos;s cloth.Configure your blog websiteYou can modify most of the configuration in the _config.yml and _config.icarus file in your local blog path. Once you open the _config.yml file, you may know how to put your personal information in it. For specific configuration, see Configuration | Hexo in English or 配置 | Hexo in Chinese and Icarus User Guide - Configuring the Theme - Icarus in English or Icarus用户指南 - 主题配置 - Icarus in Chinese.Deploy your blog website to Coding and GitHubNow we have designed the blog website, but we can only access the website locally, obviously this is not enough. So next we will use Coding and Github&apos;s Pages service to deploy the website to Coding and Github.Register Coding and GitHub accountRegister your Coding and GitHub account using your e-mail, complete the email verification. When we commit your blog to Coding or Github, your personal information is needed, it is permanently embedded in the submission. Using the following code to setup:12&gt;&gt; git config --global user.name &quot;Your name&quot;&gt;&gt; git config --global user.email &quot;Your e-mail&quot;We only need to do it once, since --global option is provided.To connect Coding and GitHub when we commit your blog, a SSH key is needed. Secure Shell (SSH) is a network protocol that allows data exchange between two computers through a secure connection. Encryption ensures the confidentiality and integrity of data. SSH uses public key encryption technology to authenticate remote hosts and (if necessary) allows remote hosts to authenticate users. Since we need to submit our blog to Coding and Github, we need to generate 2 SSH keys. Open Windows Terminal or Git Bash, type:12345678&gt;&gt; cd ~/.sshC:\\Users\\&lt;Your PC Name&gt;\\.ssh&gt; ssh-keygen -t rsa -C &quot;Your e-mail&quot;Generating public/private rsa key pair.Enter file in which to save the key (C:\\Users\\Hailin/.ssh/id_rsa): id_rsa_coding # File nameEnter passphrase (empty for no passphrase): # Set password, it can be vacant.Enter same passphrase again:Your identification has been saved in id_rsa_coding.Your public key has been saved in id_rsa_coding.pub.Open C:\\User\\&lt;Your PC Name&gt;\\.ssh\\id_rsa_coding.pub file, the string starts with ssh-rsa is your SSH key. Similarly, generate SSH keys for github:12345678&gt;&gt; cd ~/.sshC:\\Users\\&lt;Your PC Name&gt;\\.ssh&gt; ssh-keygen -t rsa -C &quot;Your e-mail&quot;Generating public/private rsa key pair.Enter file in which to save the key (C:\\Users\\Hailin/.ssh/id_rsa): id_rsa_github # File nameEnter passphrase (empty for no passphrase): # Set password, it can be vacant.Enter same passphrase again:Your identification has been saved in id_rsa_coding.Your public key has been saved in id_rsa_coding.pub.Open your Coding and GitHub account settings, add SSH keys using the string starts with ssh-rsa you generated, The file name can be arbitrary. Coding Settings Path: 个人账户设置 -&gt; SSH公钥 -&gt; 新增公钥. GitHub Settings Path: Settings -&gt; SSH and GPG keys -&gt; New SSH key. When finished, type ssh -T git@e.coding.net and ssh -T git@github.com, you will get:12345678C:\\Users\\&lt;Your PC Name&gt;\\.ssh&gt; ssh -T git@e.coding.netEnter passphrase for key &apos;C:\\Users\\&lt;Your PC Name&gt;/.ssh/id_rsa.coding&apos;: # Enter passwordCODING 提示: Hello &lt;Your Coding Name&gt;, You&apos;ve connected to coding.net via SSH. This is a Personal Key.&lt;Your Coding Name&gt;，你好，你已经通过 SSH 协议认证 coding.net 服务，这是一个个人公钥.公钥指纹：------------C:\\Users\\&lt;Your PC Name&gt;\\.ssh&gt; ssh -T git@github.comEnter passphrase for key &apos;C:\\Users\\&lt;Your PC Name&gt;/.ssh/id_rsa&apos;: # Enter passwordHi &lt;Your GitHub Name&gt;! You&apos;ve successfully authenticated, but GitHub does not provide shell access.Create a new Coding and GitHub projectCreat a public DevOps Coding project and a public GitHub project named &lt;yourname&gt;.github.io, here yourname is your GitHub name. For Coding, you should open the Pages service manually. You need to go to the project settings page in the homepage of the project, check the 持续部署 check box in the 功能开关 page. Then return to the homepage of the project, Click on the 静态网站 under 持续部署, create a website of 静态网站 type.Use Hexo to deploy your blog pages to Coding and GitHubTo deploy your blog to Coding and Github, you need to tell Hexo the repository link and you must have the authority to do these.The SSH key solves the authority problem, now you still need to tell Hexo repository&apos;s link. Add this in the _config.yml file:123456deploy:- type: git repository: coding: git@e.coding.net:&lt;Your name&gt;/&lt;Repository name&gt;.git # clone link with SSH github: git@github.com:&lt;Your name&gt;/&lt;Your name&gt;.github.io.git # clone link with SSH branch: masterYou can get the clone link with SSH on your repository page.Now everything is prepared, open command line and enter you blog path, type hexo d:1&gt;&gt; hexo dIf you set password when generating the SSH key, you need to enter the password to get the authority.Until now, you have successfully create your blog website, open &lt;your_github_name&gt;.github.io or the link provided by Coding (you can find it in the 静态网站 page, it is a long link starts with coding-pages) to enjoy your achievement!Custom domain nameIf you registered your own domain, you can link it to the domain name we got before, then go to Coding and GitHub to set the domain link.","link":"/2020/11/26/Build-a-personal-blog-website-for-free-based-on-hexo-with-coding-and-github/"},{"title":"The shear stiffness characteristics of four Eocene-to-Jurassic UK stiff calys","text":"四种始新世至侏罗纪英国刚性黏土的剪切刚度特征摘要英国南部很大一部分被坚硬的粘土所控制。改善其岩土工程特性对于许多当前和未来基础设施项目非常重要。本文对四个关键的中等可塑性、高度过度扩张的地层的复杂刚度行为进行综合研究：Gault、Kimmeridge、Oxford 和 London 粘土。后者沉积在侏罗纪和青世之间，海洋条件大致相似。对高质量样品进行了先进的静态和动态实验室测量协调方案，集中于从内陆地点类似深度采集的样品，包括采用高分辨率局部应变、多轴弯曲元和共振柱技术的三轴和空心圆柱应力路径实验。采用新方法解释空心圆柱实验，结合独立场剪切波数据对实验室测量进行检测。粘土的刚度特性明显为各向异性、应力依赖性和高度非线性。综合允许得出以下关键结论：替代测量方法的相对可靠性；粘土间刚度行为的势扩散；不同的地质年代和埋藏深度是否对粘土的刚度特性有系统的影响。研究结果具有重要的岩土工程意义。概述英国南部很大一部分被三叠纪到欧世坚硬的粘土所影响。他们的经济重要性促使帝国学院对影响国家重要基础设施的四种中等可塑性、严重超固结、侏罗纪到始新世的硬粘土的研究。第二个目的是调查地质年龄或埋藏深度是否对力学行为有任何系统影响。选定了四个采样点，这些采样点覆盖了沉积在大致相似环境中的地层。选择位置和采样深度以减少构造扰动和沉积后风化、冰川或树木作用的潜在影响。Gasparre et al. (2007) 12关于伦敦克莱研究的报告在希思罗机场5号航站楼的早期地点进行。Wilkinson (2011)3，Brosse (2012)4，Hosseini Kamal (2012) 5和 Hosseini Kamal et al. (2014) 6总结了 Gault，Kimmeridge 和 Oxford 黏土样地点的地质和岩土工程特征。Brosse (2012) 7提供了有关在空心气缸装置 （HCA） 实验中如何研究剪切强度各向异性的进一步细节。参考文献 Gasparre, A., Nishimura, S., Coop, M. R. &amp; Jardine, R. J. (2007a). The influence of structure on the behaviour of London Clay. Géotechnique 57, No. 1, 19–31. doi: 10.1680/geot.2007.57.1.19 Gasparre, A., Nishimura, S., Anh-Minh, N., Coop, M. R. &amp; Jardine, R. J. (2007b). The stiffness of natural London Clay. Géotechnique 57, No. 1, 33–47. doi: 10.1680/geot.2007.57.1.33 Wilkinson, S. (2011). The microstructure of UK mudrocks. PhD thesis, Imperial College London, London, UK. Brosse, A. (2012). Study on the anisotropy of British stiff clays using a hollow cylinder apparatus. PhD thesis, Imperial College London, London, UK. Hosseini Kamal, R. (2012). Experimental study of the geotechnical properties of UK mudrocks. PhD thesis, Imperial College London, London, UK. Hosseini Kamal, R., Coop, M. R., Jardine, R. J. &amp; Brosse, A. (2014). The post-yield behaviour of four Eocene-to-Jurassic UK stiff clays. Géotechnique 64, No. 8, 620–634. doi: 10.1680/geot.13.P.043 Brosse, A. (2012). Study on the anisotropy of British stiff clays using a hollow cylinder apparatus. PhD thesis, Imperial College London, London, UK. Gasparre, A., Nishimura, S., Coop, M. R. &amp; Jardine, R. J. (2007a). The influence of structure on the behaviour of London Clay. Géotechnique 57, No. 1, 19–31. doi: 10.1680/geot.2007.57.1.19↩︎Gasparre, A., Nishimura, S., Anh-Minh, N., Coop, M. R. &amp; Jardine, R. J. (2007b). The stiffness of natural London Clay. Géotechnique 57, No. 1, 33–47. doi: 10.1680/geot.2007.57.1.33↩︎Wilkinson, S. (2011). The microstructure of UK mudrocks. PhD thesis, Imperial College London, London, UK.↩︎Brosse, A. (2012). Study on the anisotropy of British stiff clays using a hollow cylinder apparatus. PhD thesis, Imperial College London, London, UK.↩︎Hosseini Kamal, R. (2012). Experimental study of the geotechnical properties of UK mudrocks. PhD thesis, Imperial College London, London, UK.↩︎Hosseini Kamal, R., Coop, M. R., Jardine, R. J. &amp; Brosse, A. (2014). The post-yield behaviour of four Eocene-to-Jurassic UK stiff clays. Géotechnique 64, No. 8, 620–634. doi: 10.1680/geot.13.P.043↩︎Brosse, A. (2012). Study on the anisotropy of British stiff clays using a hollow cylinder apparatus. PhD thesis, Imperial College London, London, UK.↩︎","link":"/2020/11/29/The-shear-stiffness-characteristics-of-four-Eocene-to-Jurassic-UK-stiff-calys/"},{"title":"Hello World","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub.Quick StartCreate a new post1$ hexo new &quot;My New Post&quot;More info: WritingRun server1$ hexo serverMore info: ServerGenerate static files1$ hexo generateMore info: GeneratingDeploy to remote sites1$ hexo deployMore info: Deployment","link":"/2020/11/24/hello-world/"},{"title":"有关土的强度与变形参数的参考文献","text":"强度上海土体的岩土特性及工程应用1主要内容 本文的第一部分是对上海典型土层的解释，并给出了不同土体数相关的经验公式。这是作者在岩土工程咨询服务以及基础工程实践准则的准备和修订研究中做出的努力的结果。 希望这些对其他人以及东海 (东海) 海洋地质技术的未来发展有用，因为海床土与陆地沉积物有着密切的关系。 本文的第二部分开始研究典型土层的水平渗透系数和有效覆盖压力下不排水强度的增加。在这些土体上，设计20000吨油箱的浅层基础并安预加载排水测试期的计划，获得了可观的经济效应。 上海土层类型分类 地质来源 层 土体类型 全新世 河口冲积物 1 填土 2 黄黑褐色硬壳层 浅海沉积物 3 亚黏土或轻亚黏土；淤泥；极细的砂 4 淤泥质黏土 沿海浅海沼泽沉积物；滨河河流沉积物 5 灰色亚黏土 新更新世 湖沉积物 6 深绿色坚硬层 河流沉积物 7 极细的细砂 浅海沉积物 8 灰色亚黏土 土体参数之间的经验关系 压缩指数 的经验关系 (TABLE 4, For : Skempton, 19532, Terzaghi, 19483) 有效静止土压力系数 的经验关系 TABLE 5, Jaky, 19444：) 超固结比 OCR 对 的影响 (TABLE 6, Ladd, 19775：) 孔压消散对 的影响 (EQUATION 5 and 6) 瞬时荷载土压力系数 和循环荷载土压力系数 之间的关系 (EQUATION 7) 强度比与塑性指数之间的关系 (EQUATION 8，考虑在有效应力的一定增量下不排水强度的增加量。提出这个问题的原因是，现场叶片剪切强度有时会大大超过 Terzaghi (1948)6 和 Leonards (1962)7 等其他作者的公式所给出的抗剪强度) 上海第四纪沉积物的岩土特性8上海软土地基的天然强度及强度增长9本文为上海软土强度试验资料的初步总结, 包括四个部分： 关于上海软土地基的天然强度； 软土在固结过程中强度增长的规律； 稳定分析中的几个问题； 上海软土地基预压的一些经验。 提出了上海地区自地表以下 米范围内三轴不排水强度的经验公式 ()，且正常密实土的天然不排水强度与有效覆盖压力比 ；分析了上海某厂2台油罐的充水预压资料; 初步探讨了在加荷过程中软土地基的固结规律 。从而提出了在软土地基上应考虑适应于固结速率的最佳设计这一观点 , 以减少工程投资费用。上海软粘土应力应变非线性特性的初步试验10结合上海某工程， 对地面下 2-26 米的四层粘性土所取``不扰动&apos;&apos;土样，用三轴仪做了固结不排水和排水试验，获得了以双曲线函数表达的非线性关系及参数，并用归一化的方法整理了试验资料，最后用司开浦登、贝伦的方法计算了 地基变形。 上海地区软粘土的卸荷–再加荷变形特性11计算深基础开挖回弹及再加荷时的沉降在设计中是一个有待于探讨研究的重要课题, 本文着重分析了上海软粘土在卸荷--再加荷时的变形特性, 提出了估算回弹及全补偿沉降的计算式，并探讨了三轴试验条件下土样的卸荷--再加荷变形特性, 建立了相应的应力--应变模型。 参考文献 GAO D Z, et al., 1986. Geotechnical properties of Shanghai soils and engineering applications[G]//Marine Geotechnology and Nearshore/Offshore Structures. [S.l.]: ASTM International. DOI: 10.1520/STP18412S. Skempton A W. The post-glacial clays of Thames estuary at Tilbury and Shell-haven[C]//Proc., 3rd ICSMFE. 1953, 1: 302-308. Terzaghi K, Peck R B, Mesri G. Soil mechanics in engineering practice[M]. John Wiley &amp; Sons, 1948. Jaky, J. The coefficient of earth pressure at rest Journal Soc of Hungarian Architects &amp; Engineers, 1944, 78, 355–358. Ladd C C, CC L. Stress-deformation and strength characteristics[J]. 1977. Terzaghi K, Peck R B, Mesri G. Soil mechanics in engineering practice[M]. John Wiley &amp; Sons, 1948. Leonards G A. Foundation engineering[R]. McGraw-Hill, 1962. DASSARGUES A, et al., 1991. Geotechnical properties of the Quaternary sediments in Shanghai[J]. Engineering geology, 31(1): 71-90. DOI: 10.1016/0013-7952(91)90058-S. 胡中雄, 1979. 上海软土地基的天然强度及强度增长[J/OL]. 同济大学学报 (自然科学版)(05): 56-69. http://www.cnki.com.cn/Article/CJFDTotal-TJDZ197905004.htm. 邓淑敏, 1980. 上海软粘土应力应变非线性特性的初步试验[J/OL]. 工程勘察, 000(002): 46. http://www.cnki.com.cn/Article/CJFDTotal-GCKC198002010.htm. 陈永福,曹名葆.上海地区软粘土的卸荷—再加荷变形特性[J].岩土工程学报,1990(02): 9-18. GAO D Z, et al., 1986. Geotechnical properties of Shanghai soils and engineering applications[G]//Marine Geotechnology and Nearshore/Offshore Structures. [S.l.]: ASTM International. DOI: 10.1520/STP18412S.↩︎Skempton A W. The post-glacial clays of Thames estuary at Tilbury and Shell-haven[C]//Proc., 3rd ICSMFE. 1953, 1: 302-308.↩︎Terzaghi K, Peck R B, Mesri G. Soil mechanics in engineering practice[M]. John Wiley &amp; Sons, 1948.↩︎Jaky, J. The coefficient of earth pressure at rest Journal Soc of Hungarian Architects &amp; Engineers, 1944, 78, 355–358.↩︎Ladd C C, CC L. Stress-deformation and strength characteristics[J]. 1977.↩︎Terzaghi K, Peck R B, Mesri G. Soil mechanics in engineering practice[M]. John Wiley &amp; Sons, 1948.↩︎Leonards G A. Foundation engineering[R]. McGraw-Hill, 1962.↩︎DASSARGUES A, et al., 1991. Geotechnical properties of the Quaternary sediments in Shanghai[J]. Engineering geology, 31(1): 71-90. DOI: 10.1016/0013-7952(91)90058-S.↩︎胡中雄, 1979. 上海软土地基的天然强度及强度增长[J/OL]. 同济大学学报 (自然科学版)(05): 56-69. http://www.cnki.com.cn/Article/CJFDTotal-TJDZ197905004.htm.↩︎邓淑敏, 1980. 上海软粘土应力应变非线性特性的初步试验[J/OL]. 工程勘察, 000(002): 46. http://www.cnki.com.cn/Article/CJFDTotal-GCKC198002010.htm.↩︎陈永福,曹名葆.上海地区软粘土的卸荷—再加荷变形特性[J].岩土工程学报,1990(02): 9-18.↩︎","link":"/2020/11/29/%E6%9C%89%E5%85%B3%E5%9C%9F%E7%9A%84%E5%BC%BA%E5%BA%A6%E4%B8%8E%E5%8F%98%E5%BD%A2%E5%8F%82%E6%95%B0%E7%9A%84%E5%8F%82%E8%80%83%E6%96%87%E7%8C%AE/"},{"title":"一些关于粘土参数的数据库","text":"Ching Jianye1 and Kok-Kwang Phoon2CPTU-Su (Ching and Phoon, 2012a) -- Establishment of generic transformations for geotechnical design parameters3: PDF-Original, Official Website摘要：岩土工程设计参数通常基于现场调查结果的转换来估算。通常，人们希望转换不确定性根据数据库中站点的数量和类型而变化。本研究试图解决与转换不确定性有关的以下两个问题：（a）转换不确定性如何随数据库中站点的数量和类型而变化；以及（b）当从一个足够大的数据库开发一个“通用的”转换，转换不确定性是否会最终落在狭窄的范围内。这项研究还试图提出一个框架，以建立这种通用的转换并量化其不确定性。静力触探CPTU数据与粘土的不排水抗剪强度（\\(S_u\\)）之间的转换证明了该框架。已经发现，CPTU-\\(S_u\\)变换及其不确定性取决于站点或区域，并且就平均趋势而言，一个站点的“本地”变换方程可能不适用于另一站点（众所周知）以及变异系数（COV）。提出了一种开发通用CPTU-\\(S_u\\)转换方程的方法，该方程可用于在缺乏本地数据的情况下进行下游可靠性分析或设计。敏感性分析表明，它需要至少15个站点的数据，并附带一个隐含的假设，即充分的地理覆盖范围通常意味着足够的地质多样性，才能可靠地构建此类“通用”转换方程式。关键词：转换不确定性，岩土设计参数，基于可靠性的设计，相关性，CPTU试验，不排水抗剪强度。CLAY/5/345 (Ching and Phoon, 2012b) -- Modeling parameters of structured clays as a multivariate normal distribution4: PDF-Original, Official Website摘要：这项研究探索了将流动性指数，不排水抗剪强度，重塑不排水抗剪强度，预固结应力和结构性粘土（敏感或快粘土）的垂直有效应力建模为多元正态分布的可能性。文献中充斥着两个土体参数之间的相关方程。尽管通过这种方法具有明显的实际实用性，但通过构造多元概率分布函数来一致地合成两个以上土体参数的情况很少见。这项研究汇编了一个庞大的结构化粘土数据库，以构建上述五个土体参数之间的多元概率分布。然后，使用该多元分布来模拟感兴趣的土体参数之间的相关性，并导出用于贝叶斯推断的有用方程式。通过另一个独立的结构性粘土数据库以及文献中提出的经验方程，可以进一步验证这种构造的多元分布和方程。关键词：相关性，多元正态分布，场地特征，基于可靠性的设计。CLAY/6/535 (Ching, Phoon and Chen, 2014a) -- Modeling piezocone cone penetration (CPTU) parameters of clays as a multivariate normal distribution5: PDF-Original, Official Website摘要：这项研究研究了将静力触探（CPTU）锥尖阻力，锥孔后超静孔隙水压力，不排水的剪切强度以及轻度超固结粘土的超固结比建模为多元正态分布的可能性。这是一项持续研究的一部分，该研究旨在开发可用于模拟粘土站点上常见土体参数的多元分布。这项研究建立了一个包含535个数据点的大型数据库，其中同时密切测量了CPTU参数，不排水抗剪强度和超固结比。然后，将多元正态分布用于捕获目标土体参数之间的相关性，并得出用于贝叶斯推断的有用方程。通过另一个由594个数据点组成的独立数据库以及文献中提出的经验方程，可以进一步验证这种构造的多元正态分布和方程。这项研究最有用的结果是提供一种系统的分析方法，以在存在CPTU参数的情况下更新规范化的不排水抗剪强度和超固结比的分布。关键词：相关性，多元正态分布，场地特征，静力触探（CPTU）试验，基于可靠性的设计。CLAY/7/6310 (Ching and Phoon, 2013) -- Multivariate distribution for undrained shear strengths under various test procedures6: PDF-Original, Official Website摘要：粘土的不排水剪切强度（\\(S_u\\)）不是常数。 特别是，通过不同的试验程序评估的粘土的\\(S_u\\)值是不同的，因为这些试验可能具有不同的应力状态，应力历史，采样扰动程度和应变率。 这项研究基于大型粘土数据库，通过各种试验程序构建了\\(S_u\\)的多元概率分布。 该多变量分布基于以下四个因素提供了归一化不排水剪切强度的估计值：试验模式，超固结比，应变率和可塑性。 一旦建立了这种多元分布，就可以使用简单的贝叶斯分析系统地回答有趣的问题，例如，给定一个试验程序的\\(S_u\\)值，另一试验程序的\\(S_u\\)值的更新平均值和变异系数是多少？关键词：不排水抗剪强度，不确定性，相关性，多元分布，现场调查。CLAY/10/7490 (Ching and Phoon, 2014b) -- Transformations and correlations among some clay parameters the global database7: PDF-Original, PDF-Zh-CN, Official Website摘要：本研究汇编了来自251个研究的10个粘土参数（标记为 CLAY/10/7490 ）的大型数据库，涵盖了来自全球30个地区或国家的粘土数据。因此，该“全球”数据库所涵盖的数据范围比文献中现有转换模型的标定所依据的范围要广。这些转换模型将试验测量值（例如，锥尖阻力）与适当的设计参数（例如，不排水的剪切强度）相关联。数据库显示的10个黏土参数之间的相关行为与文献中现有的转换模型所显示的相关行为一致。这些转换模型相对于全局数据库的偏差和转换不确定性已得到校准。结果发现，更新的转换模型偏差较小，并且转换不确定性通常相当大。通过合并次级输入参数（例如塑性指数或灵敏度），可以进一步降低如此大的变换的不确定性。在同作者撰写的伴随论文中，从 CLAY/10/7490 构建了耦合这些黏土参数的10维多元概率分布，并提出了一个有用的程序，其中涉及从三个独立的测量值更新两个设计参数的整个双变量概率分布。关键词：黏土特性，相关性，转换模型，数据库，统计数据。岩土变异性Phoon and Kulhawy (1999)8认为岩土变异性的三个主要来源为固有变异性（偶然性），测量误差以及转换不确定性（关于平均相关趋势分析的数据散布）。这种将岩土变异性归类为偶然性与认知性在某种程度上是建模者的选择9。Phoon and Kulhawy (1999)10提出一些土体特性的变异系数（COV）准则，用于基于可靠性的设计（RBD）的岩土工程分析。目前工程人员针对岩土工程参数的变异性的处理一般通过进行多次试验，根据实验结果评估土体特性属性值，一般做法是直接取平均值或在一定置信区间内的最坏情况的值。事实上，现场试验得到的数据本质上是多元的，受到各种因素的影响，为考虑多元参数的影响，Ching and Phoon 1112131415开发了基于贝叶斯机器学习方法的耦合多个黏土参数的多元概率分布模型。目前的问题一般来说，岩土工程时试验的结果不直接适用于设计参数，需要用一个转换模型将现场试验的参数与设计参数联系起来。大多数的转换模型都是通过使用回归分析的经验或半经验的数据拟合得到的。而且大多数模型是针对于特定区域而开发的。本研究开发了覆盖全球大量区域的全球数据库，并通过引入辅助输入参数降低模型偏差（即变异系数 COV）从而提升其精确性。模型研究的黏土参数本研究涉及到以下10个无量纲参数。 指数性质： 液限（LL）。 塑性指数（PI）。 流动性指数（LI）。 应力和强度： 归一化竖向有效应力（\\(\\sigma_{\\rm v}^\\prime/P_{\\rm a}\\)）。 归一化预固结应力（\\(\\sigma_{\\rm p}^\\prime/P_{\\rm a}\\)） 归一化不排水抗剪强度（\\(s_{\\rm u}/\\sigma_{\\rm v}^\\prime\\)）。 灵敏度（\\(S_{\\rm t}=s_{\\rm u}/s_{\\rm u}^{\\rm re}\\)）。 带孔压的静力触探试验（CPTU）参数： 孔隙压力比（\\(B_{\\rm q}=(u_2-u_0)/(q_{\\rm t}-\\sigma_{\\rm v})\\)）。 归一化锥尖阻力（\\((q_{\\rm t}-\\sigma_{\\rm v})/\\sigma_{\\rm v}^\\prime\\)）。 归一化有效锥尖阻力（\\((q_{\\rm t}-u_2)/\\sigma_{\\rm v}^\\prime\\)）。 校准现有转换模型辅助输入参数的相关性分析实现程序上述两表可用于获得感兴趣的粘土设计参数的均值和变异系数（COV）。这对于岩土工程可靠性设计（RBD）至关重要。 选择一个与全球数据库相适应的转换模型，例如 Jamiolkowsky (1985)16提出的 \\({\\rm OCR}-s_{\\rm u}/\\sigma_{\\rm v}^\\prime\\) 模型（\\({\\rm OCR}=2\\)）。 \\[ s_{\\rm u}({\\rm mob})/\\sigma_{\\rm v}^\\prime\\approx 0.23\\cdot{\\rm OCR}^{0.8} \\] 根据实际目标值与预测目标值之比获得偏差因子（\\(b\\)）和变异系数（COV），对于 \\({\\rm OCR}-s_{\\rm u}/\\sigma_{\\rm v}^\\prime\\) 模型，由表5知，\\(b=1.11\\)，\\({\\rm OCR}=0.53\\)。则有 \\(s_{\\rm u}({\\rm mob})/\\sigma_{\\rm v}^\\prime\\) 的平均值为 \\(b\\cdot 0.23\\cdot{\\rm OCR}^{0.8}=1.11\\cdot 0.23\\cdot 2^{0.8}=0.44\\)。 为降低转换不确定性（即降低变异系数 COV），若还给出其它辅助输入参数，如给出 \\({\\rm PI}=15\\) 以及 \\(S_{\\rm t}=10\\) 的信息，则可根据表6据此对均值和变异系数进行修正。\\({\\rm BCF}=0.71\\cdot ({\\rm PI}/20)^{0.133}\\cdot S_{\\rm t}^{0.123}=0.71\\cdot ({\\rm 15}/20)^{0.133}\\cdot 10^{0.123}=0.907\\)，\\({\\rm CCF}=67\\%\\)。则有 \\(s_{\\rm u}({\\rm mob})/\\sigma_{\\rm v}^\\prime\\) 的平均值修正为 \\(0.44\\cdot 0.907=0.403\\)，COV 为 \\(0.53\\cdot 67\\%=0.36\\)。 根据其它信息（例如 \\({\\rm PI}, S_{\\rm t}, (q_{\\rm t}-\\sigma_{\\rm v})/\\sigma_{\\rm v}^\\prime, B_{\\rm q}\\) 等）同样可更新均值和COV。只要建立了这些参数的多元概率分布，就可实现这样的修正17。 CLAY/10/7490 (Ching and Phoon, 2014c) -- Correlations among some clay parameters — the multivariate distribution18: PDF-Original, Official Website摘要：本文构建了涵盖10个黏土参数的10维多元概率分布。这些参数是液限，塑性指数（PI），流动性指数，有效竖向应力，不排水剪切强度，灵敏度和三个静力触探试验参数。为此，在随附的文件中编译了CLAY/10/7490数据库。该数据库包含来自251个研究的7490个数据点。与每个研究相关的数据点数量从1到419不等，每个研究平均30个数据点。粘土特性涵盖了广泛的超固结比（但大多为1至10），敏感度（\\(S_t\\)）的广泛范围（\\(S_t\\) = 1至数十或数百的位置是相当典型的）和广泛的PI（但大部分为8~100）。构造的多元概率分布可以用作先验分布，以基于有限但特定于现场的现场数据得出设计参数的联合分布。请注意，导出的是10个黏土参数的整个联合分布，而不是边际分布，或者仅是均值和变异系数。可以从多个现场测量值更新这些多个设计参数，这比使用当前实践中典型的使用一个现场测量值更新一个设计参数更有用。本文还证明了通过组合可用的双变量模型来构建多元概率模型是可行的，该模型在岩土工程相关文献中很普遍。所提出的方法避免了收集多元数据的需求，而这些数据在典型的现场调查程序中很少见。关键词：黏土特性，相关性，多元分布，数据库，统计数据。Frequentist and Bayesian (Ching, Wu and Phoon, 2015) -- Statistical characterization of random field parameters using frequentist and Bayesian approaches19: PDF-Original, Official Website摘要：由于现场调查收集的信息有限，因此无法获得有关土体属性的平均值、标准偏差和波动规模的实际值。估计值和实际值之间的偏差称为统计不确定性。至少有两种关于如何模拟统计不确定性的学派：频率学派和贝叶斯学派。本文旨在探讨其哲学差异，展示如何根据这两种截然不同的思想体系量化统计不确定性，并比较其表现。为了量化统计的不确定性，置信区间将用于频率学派，而后概率分布将用于贝叶斯学派。将举例说明这两种思想学派在一致性方面的表现。结果表明，一般来说，贝叶斯学派在一致性方面表现更好。特别是，当可用信息量非常有限时，建议使用马尔科夫链蒙特卡罗方法。‎关键词：统计不确定性，现场调查，频率学派，贝叶斯学派，可靠性。Bayesian machine learning (Ching and Phoon, 2019) -- Constructing site-specific multivariate probability distribution model using Bayesian machine learning20: PDF-Original, Official Website摘要：本研究提出了一种新型的数据驱动贝叶斯机器学习方法，用于在岩土工程中构建站点特定的多变量概率分布模型。构建特定于站点的模型有一个权衡：从通用数据开发的模型可能不完全适用于本地站点，但纯粹从有限的站点特定数据开发的模型可能由于重大的统计不确定性而非常不精确。建议的方法基于站点特定数据和通用数据之间的混合，在站点特定数据丰富时由站点特定数据控制，在站点特定数据稀疏时由泛型数据控制。这种方法大致遵循工程师目前根据有限的现场特定信息估算土体参数的方法。该方法承认多变量数据不完整，可以处理现场调查中常见的缺失数据。这是一种贝叶斯方法，因此不确定性被严格量化。实际案例研究用于证明拟议方法的有用性。分析结果表明，该方法可以有效地捕获站点特定数据中的关联行为，而且即使在站点特定数据非常稀疏时，也可以做出有意义的预测。关键词：岩土工程；场地特征； 多元概率分布模型； 转换模型；不确定性; 贝叶斯机器学习。References and footnotes Department of Civil Engineering, National Taiwan University, Taiwan. Department of Civil and Environmental Engineering, National University of Singapore, Singapore. Ching J, Phoon K K. Establishment of generic transformations for geotechnical design parameters[J]. Structural Safety, 2012, 35: 52-62. doi: 10.1016/j.strusafe.2011.12.003 Ching J, Phoon K K. Modeling parameters of structured clays as a multivariate normal distribution[J]. Canadian Geotechnical Journal, 2012, 49(5): 522-545. doi: 10.1139/t2012-015 Ching J, Phoon K K, Chen C H. Modeling piezocone cone penetration (CPTU) parameters of clays as a multivariate normal distribution[J]. Canadian Geotechnical Journal, 2014, 51(1): 77-91. doi: 10.1139/cgj-2012-0259 Ching J, Phoon K K. Multivariate distribution for undrained shear strengths under various test procedures[J]. Canadian Geotechnical Journal, 2013, 50(9): 907-923. doi: 10.1139/cgj-2013-0002 Ching J, Phoon K K. Transformations and correlations among some clay parameters—the global database[J]. Canadian Geotechnical Journal, 2014, 51(6): 663-685. doi: 10.1139/cgj-2013-0262 Phoon K K, Kulhawy F H. Characterization of geotechnical variability[J]. Canadian geotechnical journal, 1999, 36(4): 612-624. doi: 10.1139/t99-038 Der Kiureghian A, Ditlevsen O. Aleatory or epistemic? Does it matter?[J]. Structural safety, 2009, 31(2): 105-112. doi: 10.1016/j.strusafe.2008.06.020 Phoon K K, Kulhawy F H. Evaluation of geotechnical property variability[J]. Canadian Geotechnical Journal, 1999, 36(4): 625-639. doi: 10.1139/t99-039 Ching J, Phoon K K. Modeling parameters of structured clays as a multivariate normal distribution[J]. Canadian Geotechnical Journal, 2012, 49(5): 522-545. doi: 10.1139/t2012-015 Ching J, Phoon K K, Chen C H. Modeling piezocone cone penetration (CPTU) parameters of clays as a multivariate normal distribution[J]. Canadian Geotechnical Journal, 2014, 51(1): 77-91. doi: 10.1139/cgj-2012-0259 Ching J, Phoon K K. Correlations among some clay parameters—the multivariate distribution[J]. Canadian Geotechnical Journal, 2014, 51(6): 686-704. doi: 10.1139/cgj-2013-0353 Ching J, Wu S S, Phoon K K. Statistical characterization of random field parameters using frequentist and Bayesian approaches[J]. Canadian Geotechnical Journal, 2015, 53(2): 285-298. doi: 10.1139/cgj-2015-0094 Ching J, Phoon K K. Constructing site-specific multivariate probability distribution model using Bayesian machine learning[J]. Journal of Engineering Mechanics, 2019, 145(1): 04018126. doi: 10.1061/(ASCE)EM.1943-7889.0001537 Jamiolkowsky M. New developments in field and laboratory tesing of soils[C]//Proc. 11th ICSMFE. 1985, 1: 57-153. Ching J, Phoon K K. Correlations among some clay parameters—the multivariate distribution[J]. Canadian Geotechnical Journal, 2014, 51(6): 686-704. doi: 10.1139/cgj-2013-0353 Ching J, Phoon K K. Correlations among some clay parameters—the multivariate distribution[J]. Canadian Geotechnical Journal, 2014, 51(6): 686-704. doi: 10.1139/cgj-2013-0353 Ching J, Wu S S, Phoon K K. Statistical characterization of random field parameters using frequentist and Bayesian approaches[J]. Canadian Geotechnical Journal, 2015, 53(2): 285-298. doi: 10.1139/cgj-2015-0094 Ching J, Phoon K K. Constructing site-specific multivariate probability distribution model using Bayesian machine learning[J]. Journal of Engineering Mechanics, 2019, 145(1): 04018126. doi: 10.1061/(ASCE)EM.1943-7889.0001537 Department of Civil Engineering, National Taiwan University, Taiwan.↩︎Department of Civil and Environmental Engineering, National University of Singapore, Singapore.↩︎Ching J, Phoon K K. Establishment of generic transformations for geotechnical design parameters[J]. Structural Safety, 2012, 35: 52-62. doi: 10.1016/j.strusafe.2011.12.003↩︎Ching J, Phoon K K. Modeling parameters of structured clays as a multivariate normal distribution[J]. Canadian Geotechnical Journal, 2012, 49(5): 522-545. doi: 10.1139/t2012-015↩︎Ching J, Phoon K K, Chen C H. Modeling piezocone cone penetration (CPTU) parameters of clays as a multivariate normal distribution[J]. Canadian Geotechnical Journal, 2014, 51(1): 77-91. doi: 10.1139/cgj-2012-0259↩︎Ching J, Phoon K K. Multivariate distribution for undrained shear strengths under various test procedures[J]. Canadian Geotechnical Journal, 2013, 50(9): 907-923. doi: 10.1139/cgj-2013-0002↩︎Ching J, Phoon K K. Transformations and correlations among some clay parameters—the global database[J]. Canadian Geotechnical Journal, 2014, 51(6): 663-685. doi: 10.1139/cgj-2013-0262↩︎Phoon K K, Kulhawy F H. Characterization of geotechnical variability[J]. Canadian geotechnical journal, 1999, 36(4): 612-624. doi: 10.1139/t99-038↩︎Der Kiureghian A, Ditlevsen O. Aleatory or epistemic? Does it matter?[J]. Structural safety, 2009, 31(2): 105-112. doi: 10.1016/j.strusafe.2008.06.020↩︎Phoon K K, Kulhawy F H. Evaluation of geotechnical property variability[J]. Canadian Geotechnical Journal, 1999, 36(4): 625-639. doi: 10.1139/t99-039↩︎Ching J, Phoon K K. Modeling parameters of structured clays as a multivariate normal distribution[J]. Canadian Geotechnical Journal, 2012, 49(5): 522-545. doi: 10.1139/t2012-015↩︎Ching J, Phoon K K, Chen C H. Modeling piezocone cone penetration (CPTU) parameters of clays as a multivariate normal distribution[J]. Canadian Geotechnical Journal, 2014, 51(1): 77-91. doi: 10.1139/cgj-2012-0259↩︎Ching J, Phoon K K. Correlations among some clay parameters—the multivariate distribution[J]. Canadian Geotechnical Journal, 2014, 51(6): 686-704. doi: 10.1139/cgj-2013-0353↩︎Ching J, Wu S S, Phoon K K. Statistical characterization of random field parameters using frequentist and Bayesian approaches[J]. Canadian Geotechnical Journal, 2015, 53(2): 285-298. doi: 10.1139/cgj-2015-0094↩︎Ching J, Phoon K K. Constructing site-specific multivariate probability distribution model using Bayesian machine learning[J]. Journal of Engineering Mechanics, 2019, 145(1): 04018126. doi: 10.1061/(ASCE)EM.1943-7889.0001537↩︎Jamiolkowsky M. New developments in field and laboratory tesing of soils[C]//Proc. 11th ICSMFE. 1985, 1: 57-153.↩︎Ching J, Phoon K K. Correlations among some clay parameters—the multivariate distribution[J]. Canadian Geotechnical Journal, 2014, 51(6): 686-704. doi: 10.1139/cgj-2013-0353↩︎Ching J, Phoon K K. Correlations among some clay parameters—the multivariate distribution[J]. Canadian Geotechnical Journal, 2014, 51(6): 686-704. doi: 10.1139/cgj-2013-0353↩︎Ching J, Wu S S, Phoon K K. Statistical characterization of random field parameters using frequentist and Bayesian approaches[J]. Canadian Geotechnical Journal, 2015, 53(2): 285-298. doi: 10.1139/cgj-2015-0094↩︎Ching J, Phoon K K. Constructing site-specific multivariate probability distribution model using Bayesian machine learning[J]. Journal of Engineering Mechanics, 2019, 145(1): 04018126. doi: 10.1061/(ASCE)EM.1943-7889.0001537↩︎","link":"/2020/12/02/%E4%B8%80%E4%BA%9B%E5%85%B3%E4%BA%8E%E7%B2%98%E5%9C%9F%E5%8F%82%E6%95%B0%E7%9A%84%E6%95%B0%E6%8D%AE%E5%BA%93/"},{"title":"Ching2014 - Transformations and correlations among some clay parameters - the global database","text":"一些黏土参数之间的转换及其相关性 —— 全球数据库1摘要本研究汇编了来自251个研究的10个粘土参数（标记为CLAY/10/7490）的大型数据库，涵盖了来自全球30个地区或国家的粘土数据。因此，该“全球”数据库所涵盖的数据范围比文献中现有转换模型的标定所依据的范围要广。这些转换模型将测试测量值（例如，锥头阻力）与适当的设计参数（例如，不排水的剪切强度）相关联。数据库显示的10个黏土参数之间的相关行为与文献中现有的转换模型所显示的相关行为一致。这些转换模型相对于全局数据库的偏差和转换不确定性已得到校准。结果发现，更新的转换模型偏差较小，并且转换不确定性通常相当大。通过合并次级输入参数（例如可塑性指数或灵敏度），可以进一步降低如此大的变换不确定性。在同一位作者撰写的伴随论文中，从CLAY/10/7490构建了耦合这些黏土参数的10维多元概率分布，并提出了一个有用的应用程序，其中涉及从三个独立的测量值更新两个设计参数的整个双变量概率分布。关键词：黏土特性，相关性，转换模型，数据库，统计数据。概述岩土变异性是一个复杂的属性，需要仔细评估。 Phoon, 1999a2使用相当广泛的土体统计数据证明，岩土工程变异性取决于现场条件，与现场测试相关的测量误差以及将现场测试与设计属性相关联的相关模型的质量。第一部分是土体固有的变异性，由于无法通过执行更多的测试来减少，因此习惯上被归类为无酸。第二和第三部分，即不可避免地在测试过程中引入的测量误差和关于平均相关趋势的数据散布（通常以线性回归方程的形式），本质上通常被归类为认识论。可以通过收集更多数据或建立更好的模型来减少它们。尽管将不确定性归类为偶然性或认知性是有好处的，但应该记住，这种划分在某种程度上是建模者的选择3。从实践的角度来看，将地物特征与已经嵌入到我们的岩土工程实践中的属性评估程序对齐可能更为重要。考虑到需要尊重合理的岩土工程实践，4提出了一些土体特性的变异系数（COV）的准则，这些准则是测试方法，相关方程和土体类型的函数。这项研究的关键结论是，不可能为设计特性（例如不排水的剪切强度）分配单个变异系数（COV）。使用这种单一COV假设进行校准的基于岩土工程的基于可靠性的设计（RBD）方程过于简单，因为忽略了估算土体性质的多种方法。实际上，这种多样性是一种好习惯，因为有必要适应各种现场条件。 56提倡，对岩土工程RBD方程的标定应在明确认识到物性变异性的前提下进行，并完全符合实际中对土体物性的评估方法。 78建议的框架和随后的三层土体性质变异性分类方案[^Phoon2008344]应被视为变异性表征的最低要求。 ISO 2394第三版（关于结构可靠性的一般原则；将于2015年发布）包括有关“岩土结构可靠性”的新附件D，在该附录D中，强烈强调了在变异性表征和可靠性校准中尊重岩土工程实践的重要性。岩土工程变异性的表征还远远不是研究的成熟领域。精明的从业人员会很容易地指出，在现场调查中通常会进行多次测试，并且通常的做法是根据这些测试来评估设计属性，方法是直接取平均值，或者从测试产生的值的范围内选择可信的最坏情况下的值。不同的测试。在现场调查程序中收集的信息本质上本质上是多元的，并且在上述早期研究中并未考虑到这方面。本文的目的是为10个常见黏土参数建立无偏转换模型并量化其相关的不确定性。伴随论文9开发了耦合这些粘土参数的多元概率模型。支持数据库包含来自紧密收集的多个测试的信息。换句话说，每个数据点记录特定位置和深度，即特定采样点的土体信息。请注意，存在测量误差，但是在传统的站点调查程序中无法将测量误差与变换不确定性区分开。因此，本研究中提出的变换不确定性包括一些测量误差，但是对于使用带孔压的静力触探试验（CPTU）进行的圆锥渗透测试，这些误差相对较小10。这项研究显然没有考虑土体固有的变异性。原则上，可以通过将多元概率模型（适用于采样“点”）扩展到覆盖整个站点的三维（3D）空间域的向量随机字段来合并固有的土体可变性。因此，从这个意义上说，这项研究的结果是不完整的，但可以认为它们为表征岩土工程变异性铺平了道路，使岩土变异性超越了单变量数据，并与现场调查程序在实际实践中对土体特性的估算更加接近。正如11指出的那样，岩土试验的测量结果通常不适用于设计。 取而代之的是，需要一个转换模型来将测试度量与适当的设计参数相关联。 岩土工程中的大多数转换模型都是通过使用回归分析的经验或半经验数据拟合获得的。 出于实际考虑，这些转换模型已在岩土工程实践中广泛采用。 这些模型的有用汇编（主要是成对相关）可在文献中找到（例如 Kulhawy, 199012; Mayne,200113）。 粗略地回顾一下这些汇编，将会发现令人困惑的各种模型。 大多数模型是针对特定的土工材料类型和（或）特定的区域设置而开发的。在没有适当了解地球物质行为和地质的情况下，不加选择地将这些模型应用于其他地点并不明智。这种“特定于地点”的限制是岩土工程实践的独特和基本特征。岩土设计必须意识到这一局限性，以避免对“地面真相”的过分简化。与特定地点的模型相反，[^Ching2012]演示了“全局”模型的构建。全局模型是根据覆盖许多站点和岩土材料类型的全局数据库进行校准的。 [^Ching2012]观察到，特定于站点的模型通常比全局模型更为精确，但将其应用于其他站点时可能会出现明显偏差。相反，全局模型不如特定于站点的模型精确，但它们的偏向性较小。他们的观察已经得到工程师的赞赏。[^Ching2012]的主要贡献是使用庞大的全球数据库以严格的统计数据证明了这些观察结果。由于大多数转化模型都是基于其自身的数据库构建的，因此，其应用范围原则上仅限于数据库中包含的特征范围，例如某些土体类型，某些土体特性范围（例如不敏感的粘土），和某些地理位置。在全球范围内应用这些模型时（即在校准范围之外应用这些模型），评估它们的偏差和不确定性很重要。在当前的论文中，一个全球粘土数据库被编译并呈现出来。该数据库包含来自251个研究的数据点，涵盖了来自全球30个地区或国家的粘土数据。因此，该“全球”数据库所涵盖的数据范围比文献中现有转换模型的标定所依据的范围要广。黏土的10个主要参数是我们关注的重点，其中包括三个指数属性（即，阿特伯格极限）；有效应力，剪切强度和灵敏度的四个参数；以及带孔压的静力触探试验（CPTU）的三个参数。就数据点的数量和感兴趣的参数的数量而言，该全局数据库是迄今为止作者编写的最大的数据库。\\cntableref{table:1]显示了作者编译的数据库，标记为（土体类型）/（感兴趣的参数数量）/（数据点数量）。当前的全局数据库是CLAY/10/7490。本文的首要目的是介绍这个大型数据库，并验证数据点中的相关行为是否与文献中现有转换模型所显示的行为一致。这些模型大多数是特定于站点的模型。这些模型中的偏差和不确定性将使用全球数据库进行估算。当特定位置的模型的偏差得到纠正并且适当地修改了转换不确定性时，可以将其应用于更广泛的条件。所产生的全局模型的不确定性不可避免地很大，因为需要它们适应更大范围的粘土，例如不敏感，敏感和快速的粘土。通过将土体指数属性（例如可塑性指数和敏感性）视为辅助输入（解释性）参数，可以减少变换不确定性。现有的大多数转换模型都不包含此类辅助参数。但是，通过本研究中编译的全局数据库，可以使用辅助输入参数来扩展现有的转换模型。所得模型仍将是全局模型，但不确定性较小。这是本文的第二个目的。在随附的论文中[^Ching20146]，从CLAY/10/7490构建了耦合这些黏土参数的10维多元概率分布，并呈现了一个有用的从三个独立的测量值中更新两个设计参数的整体二元概率分布的应用。参考文献[^Alberro 1973]: J. Alberro and E. Santoyo. Long term behavior of mexico city clay. Proceedings of the 8th International Conference on Soil Mechanics and Foundation Engineering, 1:1–9, 1973. [^Amerasinghe1975]: Srinath F. Amerasinghe and Richard H.G. Parry. Anisotropy in heavily overconsolidated kaolin. ASCE J Geotech Eng Div, 101(12):1277–1293, 1975. [^Andersen1980]: K.H. Andersen, J.H. Pool, S.F. Brown, and W.F. Rosebrand. Cyclic and static laboratory tests on drammen clay. Journal of the Geotechnical Engineering Division, ASCE, 106(GT5, Proc. Paper, 15434):499–529, 1980. [^Andersen1982]: Knut H. Andersen and Per Stenhamar. Static plate loading tests on overconsolidated clay. Journal of the Geotechnical Engineering Division, 108(GT7):918–934, 1982. [^Andresen1957]: A. Andresen and L. Bjerrum. Discussion contributions from Scandinavia, pages 54–60, 1957. [^Azzouz1983]: Amr S. Azzouz, Mohsen M. Baligh, and Charles C. Ladd. Cone penetration and engineering properties of the soft orinoco clay. volume 1, pages 161–180, 1983. [^Azzouz1986]: A.S. Azzouz and D.G. Lutz. Shaft behavior of a model pile in plastic empire clays. Journal of Geotechnical Engineering, 112(4):389–406, 1986. doi: 10.1061/(ASCE)0733-9410(1986)112:4(389). [^Balasubramaniam1976]: A.S. Balasubramaniam and A.R. Chaudhry. Stress strain behaviour of soft bangkok clay. 1:390–401, 1976. [^Baligh1980]: M.M. Baligh, V. Vivatrat, and C.C. Ladd. Cone penetration in soil profiling. Journal of the Geotechnical Engineering Division, ASCE, 106(GT4, Proc. Paper, 15377):447–461, 1980. [^Banerjee1978]: P.K. Banerjee and A.S. Stipho. Associated and non‐associated constitutive relations for undrained behaviour of isotropic soft clays. International Journal for Numerical and Analytical Methods in Geomechanics, 2(1):35–56, 1978. doi: 10.1002/nag.1610020104. [^Baracos1980]: A. Baracos, J. Graham, and L. Domaschuk. Yielding and rupture in a lacustrine clay. Canadian Geotechnical Journal, 17(4):559–573, 1980. doi: 10.1139/t80-063. [^Battaglio1986]: M. Battaglio, D. Bruzzi, M. Jamiolkowski, and R. Lancellotta. Interpretation of cpt’s and cptu’s. Proceedings of the 4th International Geotechnical Seminar, pages 129–143, 1986. [^Berre1973]: T. Berre and L. Bjerrum. Shear strength of normally consolidated clays. Proceedings, 8th International Conference on Soil Mechanics and Foundations Engineering, 1(1):39–49, 1973. [^Bishop1971]: A.W. Bishop. Shear strength parameters for undisturbed and remolded soil specimens. Proceedings of the Roscoe Memorial Symposium, pages 3–58, 1971. [^Bishop1965]: A.W. Bishop, D.L. Webb, and P.I. Lewin. Undisturbed samples of london clay from the ashford common shaft: Strength-effective stress relationships. Geotechnique, 15(1):1–31, 1965. doi: 10.1680/geot.1965.15.1.1. [^Bjerrum1954]: L. Bjerrum. Geotechnical properties of norwegian marine clays. Geotechnique, 4(2):49–69, 1954. doi: 10.1680/geot.1954.4.2.49. [^Bjerrum1967]: L. Bjerrum. Engineering geology of norwegian normally-consolidated marine clays as related to settlements of buildings. Geotechnique, 17(2):83–118, 1967. doi: 10.1680/geot.1967.17.2.83. [^Bjerrum1969]: L. Bjerrum. Discussion of main session 5: Stability of natural slopes and embankment foundations. Proceedings of the 7th International Conference on Soil Mechanics and Foundation Engineering, 3:377–414, 1969. [^Bjerrum1972]: L. Bjerrum. Embankments on soft ground. Proceedings of the American Society of Civil Engineers Specialty Conference on Performance of Earth and Earth-Supported Structures, 2:1–54, 1972. [^Bjerrum1973]: L. Bjerrum. Problems of soil mechanics and construction on soft clays. Proceedings of the 8th International Conference on Soil Mechanics and Foundation Engineering, 3:111–159, 1973. [^Bjerrum1963]: L. Bjerrum and K.Y. Lo. Effect of aging on the shear-strength properties of a normally consolidated clay. Geotechnique, 13(2):147–157, 1963. doi: 10.1680/geot.1963.13.2.147. [^Bjerrum1960]: L. Bjerrum and N.E. Simons. Comparison of shear strength characteristics of normally consolidated clays. Proceedings of the ASCE Research Conference on the Shear Strength of Cohesive Soils, pages 711–726, 1960. [^Bozozuk1972]: M. Bozozuk and G.A. Leonards. The gloucester test fill. Proceedings of the ASCE Specialty Conference on Performance of Earth and Earth-Supported Structures, 1(PART 1):299–317, 1972. [^Broms1963]: B.B. Broms and A.M. Ratnam. Shear strength of an anisotropically consolidated clay. Journal of the Soil Mechanics and Foundations Division, ASCE, 89(6):1–26, 1963. [^Burland1977]: J.B. Burland, T.I. Longworth, and J.F.A. Moore. A study of ground movement and progressive failure caused by a deep excavation in oxford clay. Geotechnique, 27(4):557–591, 1977. doi: 10.1680/geot.1977.27.4.557. [^Cadling 1950]: L. Cadling and S. Odenstad. The vane borer: An apparatus for determining the shear strength of clay soils directly in the ground. Proc. R. Swed. Geot. Inst, 2(2):1–87, 1950.[^]: Ching2012bJ. Ching and K.-K. Phoon. Modeling parameters of structured clays as a multivariate normal distribution. Canadian Geotechnical Journal, 49(5):522–545, 2012b. doi: 10.1139/T2012-015.[^]: R.Q. Coutinho. Characterization and engineering properties of recife soft clays - brazil. volume 3-4, pages 2049–2099, 2007.[^DeGroot 2003]: D.J. DeGroot and A.J. Lutenegger. Geology and engineering properties of connecticut valley varved clay. Characterisation and Engineering Properties of Natural Soils, 1:695–724, 2003. [^DiBiagio1976]: Elmo DiBiagio and Per Stenhamar. Test fill to failure on soft clay. [provefylling til brudd pa blot leire.]. Nor Geotek Inst Publ, (110):9–14, 1976. [^Donaghe1978]: R.T. Donaghe and F.C. Townsend. Effects of anisotropic versus isotropic consolidation in consolidated-undrained triaxial compression tests of cohesive soils. Geotechnical Testing Journal, 1(4):173–189, 1978. doi: 10.1520/gtj10868j. [^Duncan1966]: J.M. Duncan and H.B. Seed. Anisotropy and stress reorientation in clay. Journal of the Soil Mechanics and Foundations Division, ASCE, 92(SM5):21–50, 1966. [^Eden1962]: W.J. Eden and M. Bozozuk. Foundation failure of a silo on varved clay. The Engineering Journal, 45(9):54–57, 1962. [^Eden1957a]: W.J. Eden and C.B. Crawford. Geotechnical properties of leda clay in the ottawa area. Proceedings of the 4th International Conference on Soil Mechanics and Foundation Engineering, 1:22–27, 1957. [^Eden1957b]: W.J. Eden and J.J. Hamilton. The use of a field vane apparatus in sensitive clay. Proceedings of the American Society For Testing Materials Symposium On In-Place Shear Testing of Soil By the Vane Method. ASTM Special Technical Publication, 193:41–53, 1957. [^Eden1961]: W.J. Eden and J.K. Kubota. Some observations on the measurement of sensitivity of clays. Proceedings of the ASTM, 61:1239–1249, 1961. [^Eden1980]: W.J. Eden and K.T. Law. Comparison of undrained shear strength results obtained by different test methods in soft clays. Canadian Geotechnical Journal, 17(3):369–381, 1980. doi: 10.1139/t80-044. [^Eden1968]: W.J. Eden and H.B. Poorooshasb. Settlement observations at kars bridge. Canadian Geotechnical Journal, 5(1):28–45, 1968. doi: 10.1139/t68-003. [^Egashira1982]: K. Egashira and M. Ohtsubo. Smectite in marine quick-clays of japan. Clays and Clay Minerals, 30(4):275–280, 1982. doi: 10.1346/CCMN.1982.0300404. [^Eide1972]: O. Eide and S. Holmberg. Test fills to failure on the soft bangkok clay. Proceedings of the Specialty Conference on Earth and Earth-supported Structures, 1(1):159–180, 1972. [^Endley1979]: S.N. Endley, E.J. Ulrich, and J.B. Gray. A study of axial pile load tests. Symposium on Deep Foundations, pages 101–121, 1979. [^Esu1969]: F. Esu and G. Calabresi. Slope stability in an overconsolidated clay. Proc., 7th Int. Conf. in Soil Mechanics and Foundation Engineering, 2:555–563, 1969. [^Feyling-Hanssen1957]: R.W. Feyling-Hanssen. Micropaleontology applied to soil mechanics in Norway, (197), 1957. [^Finno1989]: R.J. Finno. Subsurface conditions and pile installation data: 1989 foundation engineering congress test section. Predicted and Observed Axial Behavior of Piles, pages 1–74, 1989. [^Flaate1974]: Kaare Flaate and Terje Preber. Stability of road embankments in soft clay. Canadian Geotechnical Journal, 11(1): 72–88, 1974. doi: 10.1139/t74-006. [^Focht1991]: John A. Focht and Chester J. Drash Jr. Behaviour of drilled piers in layered soils on texas barrier islands. In Clyde N. Baker, editor, Drilled piers and caissons II, pages 76–98, 1991. [^Gregersen1979a]: O. Gregersen. Kvikkleireskredet I Rissa, pages 535–548, 1979. [^Gregersen1979b]: O. Gregersen and T. Løken. The quick-clay slide at baastad, norway, 1974. Engineering Geology, 14(2-3):183–196, 1979. doi: 10.1016/0013-7952(79)90084-X. [^Hansen1980]: L.A. Hansen and G.W. Clough. Characterization of undrained anisotropyof clays. In R.N. Yong and E.T. Seli, editors, Proceedings, Symposium on Limit Equilibrium, Plasticity, and Generalized Stress Strain Applications in Geotechnical Engineering, pages 253–276, ASCE, New York, 1980. [^Hanzawa1977a]: H. Hanzawa. Field and laboratory behavior of khor al-zubair clay, iraq. Soils and Foundations, 17(4):17–30, 1977a. [^Hanzawa1981]: H. Hanzawa. Improvement of a quick sand. Proceedings of the International Conference on Soil Mechanics and Foundation Engineering, 3:683–686, 1981. [^Hanzawa1979a]: H. Hanzawa, T. Matsuno, and K. Tsuji. Undrained strength and stability analysis of soft iraqi clays. Soils and Foundations, 19(2):1–14, 1979. [^Hanzawa1977b]: Hideo Hanzawa. Geotechnical properties of normally consolidated fao clay, iraq. Soils and Foundations, 17(4):1–15, 1977b. doi: 10.3208/sandf1972.17.4_1. [^Hanzawa1979b]: Hideo Hanzawa. Undrained strength characteristics of an alluvial marine clay in the tokyo bay. Soils and Foundations, 19(4):69–84, 1979. doi: 10.3208/sandf1972.19.4_69. [^Hara1974]: A. Hara, T. Ohta, M. Niwa, S. Tanaka, and T. Banno. Shear modulus and shear strength of cohesive soils. Soils and Foundations, 14(3):1–12, 1974. [^Harris1995]: C. Harris, M.C.R. Davies, and J.‐P. Coutard. Laboratory simulation of periglacial solifluction: Significance of porewater pressures, moisture contents and undrained shear strengths during soil thawing. Permafrost and Periglacial Processes, 6(4):293–311, 1995. doi: 10.1002/ppp.3430060403. Ching J, Phoon K K. Transformations and correlations among some clay parameters—the global database[J]. Canadian Geotechnical Journal, 2014, 51(6): 663-685. doi: 10.1139/cgj-2013-0262 K.-K. Phoon and F.H. Kulhawy. Characterization of geotechnical variability. Canadian Geotechnical Journal, 36(4): 612–624, 1999a. doi: 10.1139/t99-038. Armen Der Kiureghian and Ove Ditlevsen. Epistemic or aleatory? does it matter? Proceedings of the Special Workshop on Risk Acceptance and Risk Communication, 2007. K.-K. Phoon and F.H. Kulhawy. Evaluation of geotechnical property variability. Canadian Geotechnical Journal, 36 (4):625–639, 1999b. doi: 10.1139/t99-039. K.-K. Phoon and F.H. Kulhawy. Characterization of geotechnical variability. Canadian Geotechnical Journal, 36(4): 612–624, 1999a. doi: 10.1139/t99-038. K.-K. Phoon and F.H. Kulhawy. Evaluation of geotechnical property variability. Canadian Geotechnical Journal, 36 (4):625–639, 1999b. doi: 10.1139/t99-039. K.-K. Phoon and F.H. Kulhawy. Characterization of geotechnical variability. Canadian Geotechnical Journal, 36(4): 612–624, 1999a. doi: 10.1139/t99-038. K.-K. Phoon and F.H. Kulhawy. Evaluation of geotechnical property variability. Canadian Geotechnical Journal, 36 (4):625–639, 1999b. doi: 10.1139/t99-039. Ching J, Phoon K K. Transformations and correlations among some clay parameters—the global database[J]. Canadian Geotechnical Journal, 2014, 51(6): 663-685. doi: 10.1139/cgj-2013-0262 K.-K. Phoon and F.H. Kulhawy. Characterization of geotechnical variability. Canadian Geotechnical Journal, 36(4): 612–624, 1999a. doi: 10.1139/t99-038. K.-K. Phoon and F.H. Kulhawy. Characterization of geotechnical variability. Canadian Geotechnical Journal, 36(4): 612–624, 1999a. doi: 10.1139/t99-038. F.H. Kulhawy and P.W. Mayne. Manual on estimating soil properties for foundation design. Manual on Estimating Soil Properties for Foundation Design, 1990. P. W. Mayne, B. R. Christopher, and J. Dejong. Manual on subsurface investigations. National Highway Institute Publication No. FHWA NHI-01-031, 2001. Ching J, Phoon K K. Transformations and correlations among some clay parameters—the global database[J]. Canadian Geotechnical Journal, 2014, 51(6): 663-685. doi: 10.1139/cgj-2013-0262↩︎K.-K. Phoon and F.H. Kulhawy. Characterization of geotechnical variability. Canadian Geotechnical Journal, 36(4): 612–624, 1999a. doi: 10.1139/t99-038.↩︎Armen Der Kiureghian and Ove Ditlevsen. Epistemic or aleatory? does it matter? Proceedings of the Special Workshop on Risk Acceptance and Risk Communication, 2007.↩︎K.-K. Phoon and F.H. Kulhawy. Evaluation of geotechnical property variability. Canadian Geotechnical Journal, 36 (4):625–639, 1999b. doi: 10.1139/t99-039.↩︎K.-K. Phoon and F.H. Kulhawy. Characterization of geotechnical variability. Canadian Geotechnical Journal, 36(4): 612–624, 1999a. doi: 10.1139/t99-038.↩︎K.-K. Phoon and F.H. Kulhawy. Evaluation of geotechnical property variability. Canadian Geotechnical Journal, 36 (4):625–639, 1999b. doi: 10.1139/t99-039.↩︎K.-K. Phoon and F.H. Kulhawy. Characterization of geotechnical variability. Canadian Geotechnical Journal, 36(4): 612–624, 1999a. doi: 10.1139/t99-038.↩︎K.-K. Phoon and F.H. Kulhawy. Evaluation of geotechnical property variability. Canadian Geotechnical Journal, 36 (4):625–639, 1999b. doi: 10.1139/t99-039.↩︎Ching J, Phoon K K. Transformations and correlations among some clay parameters—the global database[J]. Canadian Geotechnical Journal, 2014, 51(6): 663-685. doi: 10.1139/cgj-2013-0262↩︎K.-K. Phoon and F.H. Kulhawy. Characterization of geotechnical variability. Canadian Geotechnical Journal, 36(4): 612–624, 1999a. doi: 10.1139/t99-038.↩︎K.-K. Phoon and F.H. Kulhawy. Characterization of geotechnical variability. Canadian Geotechnical Journal, 36(4): 612–624, 1999a. doi: 10.1139/t99-038.↩︎F.H. Kulhawy and P.W. Mayne. Manual on estimating soil properties for foundation design. Manual on Estimating Soil Properties for Foundation Design, 1990.↩︎P. W. Mayne, B. R. Christopher, and J. Dejong. Manual on subsurface investigations. National Highway Institute Publication No. FHWA NHI-01-031, 2001.↩︎","link":"/2020/12/02/Ching2014-Transformations-and-correlations-among-some-clay-parameters-the-global-database/"}],"tags":[{"name":"Coding GitHub Blog Hexo Icarus","slug":"Coding-GitHub-Blog-Hexo-Icarus","link":"/tags/Coding-GitHub-Blog-Hexo-Icarus/"},{"name":"shear stiffness characteristics; UK stiff calys","slug":"shear-stiffness-characteristics-UK-stiff-calys","link":"/tags/shear-stiffness-characteristics-UK-stiff-calys/"},{"name":"Database","slug":"Database","link":"/tags/Database/"}],"categories":[]}